<?xml version="1.0"?>
<net name="identity" version="11">
	<layers>
		<layer id="0" name="output" type="Parameter" version="opset1">
			<data shape="1,3,4,4" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input,output">
					<dim>1</dim>
					<dim>3</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="output/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2024.6.0-17404-4c0f47d2335-releases/2024/6" />
		<conversion_parameters>
			<is_python_object value="False" />
			<output_model value="models/ov-ir-fp16/heron-optimized.xml" />
		</conversion_parameters>
	</rt_info>
</net>
